-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Nov 03, 2017 at 05:48 AM
-- Server version: 10.1.25-MariaDB
-- PHP Version: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stinky`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `name` text CHARACTER SET utf8 NOT NULL,
  `img` text CHARACTER SET utf8 NOT NULL,
  `brand` varchar(60) CHARACTER SET utf8 NOT NULL,
  `category_id` int(11) NOT NULL,
  `flavor` varchar(60) NOT NULL,
  `size` text NOT NULL,
  `description` text NOT NULL,
  `unit_price` float(19,2) NOT NULL,
  `expiration_date` date NOT NULL,
  `date_added` date NOT NULL,
  `store_price` float(19,2) NOT NULL,
  `inventory` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `img`, `brand`, `category_id`, `flavor`, `size`, `description`, `unit_price`, `expiration_date`, `date_added`, `store_price`, `inventory`) VALUES
(1, '加多宝凉茶植物饮料', '36.90 加多宝凉茶植物饮料盒装250ml*24 箱装.jpg', '加多宝', 5, 'flavor1', '24 bottles', 'Nice beer', 24.00, '2017-07-01', '2017-06-02', 20.00, 332),
(2, '可口可乐330ml', '38.80 可口可乐330ml*24听整箱.jpg', '可口可乐', 4, 'flavor1', '9pcs', 'Chicken Wing', 19.90, '2017-06-07', '2017-06-01', 16.00, 55),
(3, '锐澳（RIO）洋酒 鸡尾酒', '75.00 锐澳（RIO）洋酒 鸡尾酒 预调酒果酒混合装（六种口味）275ml*6瓶.jpg', '锐澳', 7, 'default', 'test', '', 3.00, '2017-06-14', '2017-06-09', 2.00, 0),
(4, '雪碧 330ml', '38.80 雪碧 330ml*24听箱.jpg', '雪碧', 4, 'flavor1', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 2.00, 5),
(5, '芬达碳酸饮料', '39.80 芬达碳酸饮料330ml*24听 整箱.jpg', '芬达', 4, 'flavor2', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 1.00, 6),
(6, '雪碧 500ml', '59.90 雪碧 500ml*24箱.jpg', '雪碧', 4, 'flavor3', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 1.00, 9),
(7, '养元', '61.90 养元240ml*20.jpg', '养元', 6, 'flavor1', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 1.00, 8),
(8, '雀巢（Nestle） (丝滑拿铁)咖啡', '77.90 雀巢（Nestle） (丝滑拿铁)咖啡268ml*15瓶.jpg', '雀巢', 5, 'flavor2', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 3.00, 7),
(9, '红牛维生素功能饮料250ml', '135.00 红牛维生素功能饮料250ml*24罐 整箱.jpg', '红牛', 6, 'flavor3', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 1.00, 10),
(10, '红牛牛磺酸强化型饮料250ml', '149.00 红牛牛磺酸强化型饮料250ml*24罐 整箱.jpg', '红牛', 6, 'flavorN', 'test', 'test', 2.00, '2017-06-14', '2017-06-09', 1.00, 10),
(11, '士力架花生夹心巧克力', '13.9 士力架花生夹心巧克力（分享装）糖果巧克力休闲零食240g.jpg', '士力架', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 9),
(12, '德芙Dove巧克力分享碗装', '29.90 德芙Dove巧克力分享碗装 丝滑牛奶巧克力糖果巧克力休闲零食252g.jpg', '德芙', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 4),
(13, ' 好时（Hershey’s）Kisses袋装散装', '45.90 好时（Hershey’s）Kisses袋装散装 牛奶巧克力(电商版红色) 糖果休闲零食500g.jpg', '好时', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 6),
(14, '伊利 安慕希希腊风味常温酸奶原味', '59.20 伊利 安慕希希腊风味常温酸奶原味205g*12盒 礼盒装.jpg', '伊利', 6, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 111),
(15, '京东海外直采 费列罗Ferrero Rocher榛子牛奶巧克力礼盒', '72.00 京东海外直采 费列罗Ferrero Rocher榛子牛奶巧克力礼盒30粒 意大利进口 375g.jpg', '费列罗', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 55),
(16, '韩国进口 韩国农协 蜂蜜柚子茶', '42.90 韩国进口 韩国农协 蜂蜜柚子茶1000g.jpg', '韩国农协', 5, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 111),
(17, '果果贝瑞(GOGO BERRY) 加拿大进口 蜜饯果干 休闲零食 蓝莓干', '43.80 果果贝瑞(GOGO BERRY) 加拿大进口 蜜饯果干 休闲零食 蓝莓干100g袋.jpg', '果果贝瑞', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 623),
(18, '印尼进口 Danisa 皇冠 丹麦 曲奇', '49.90 印尼进口 Danisa 皇冠 丹麦 曲奇 454g（新旧包装随机发货） 盒装.jpg', 'Danisa', 9, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 1245),
(19, '家乐氏 Kellogg’s 水果麦片 谷兰诺拉 草莓什锦', '52.80 家乐氏 Kellogg’s 水果麦片 谷兰诺拉 草莓什锦 即食谷物早餐 490g（35g*14小袋）.jpg', '家乐氏', 9, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 1245),
(20, '三匠苦荞茶官方旗舰店 黑苦荞茶全株茶', '53.00 三匠苦荞茶官方旗舰店 黑苦荞茶全株茶240克盒装 麦香型.jpg', '三匠', 5, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 1245),
(21, '法国进口 雀巢（Nestle） 金牌咖啡法式烘焙', '69.00 法国进口 雀巢（Nestle） 金牌咖啡法式烘焙 100g.png', '雀巢', 5, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 14),
(22, '美国进口优鲜沛Ocean Spray蔓越莓干', '69.00 美国进口优鲜沛Ocean Spray蔓越莓干1360g.jpg', 'new', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 145),
(23, 'knoppers 牛奶巧克力榛子威化饼干', '69.90 knoppers 牛奶巧克力榛子威化饼干 600g盒 德国进口.jpg', 'knoppers', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 733),
(24, '丹麦进口 Kjeldsens 丹麦蓝罐 曲奇饼干 礼盒 ', '99.00 丹麦进口 Kjeldsens 丹麦蓝罐 曲奇饼干 礼盒 908g 盒装.jpg', 'Kjeldsens', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 34621),
(25, '法国进口 巴黎水Perrier气泡矿泉水 原味 玻璃瓶装1箱 ', '139.00 法国进口 巴黎水Perrier气泡矿泉水 原味 玻璃瓶装1箱 330MLx24瓶.jpg', 'Perrier', 5, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 1235),
(26, '158.00 浓情厚礼·品味装806g 四川成都特产牛肉干礼盒大礼包送礼', '158.00 浓情厚礼·品味装806g 四川成都特产牛肉干礼盒大礼包送礼.jpg', '四川成都特产', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(27, '7.5 中国台湾进口张君雅小妹妹休闲丸子（日式风味）80g', '7.5 中国台湾进口张君雅小妹妹休闲丸子（日式风味）80g.jpg', '张君雅', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(28, '9.9 马来西亚进口 马奇新新 巧克力夹心巧心卷饼干 80g 鸡蛋卷酥 休闲零食', '9.9 马来西亚进口 马奇新新 巧克力夹心巧心卷饼干 80g 鸡蛋卷酥 休闲零食.jpg', '马来西亚进口 ', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(29, '14.80 泰国进口 休闲零食 小老板 烤海苔卷 脆紫菜卷 原味 32.4g盒', '14.80 泰国进口 休闲零食 小老板 烤海苔卷 脆紫菜卷 原味 32.4g盒.jpg', '泰国进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(30, '23.8 印尼进口 丽芝士 休闲零食 Richeese 纳宝帝 奶酪味 威化饼干 350g罐', '23.8 印尼进口 丽芝士 休闲零食 Richeese 纳宝帝 奶酪味 威化饼干 350g罐.jpg', '印尼进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(31, '25.00 葡韵手信 澳门特色 休闲零食 传统糕点小吃 千层酥150g', '25.00 葡韵手信 澳门特色 休闲零食 传统糕点小吃 千层酥150g.jpg', '葡韵手信', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(32, '36.90 韩国进口海牌海苔2g*32包', '36.90 韩国进口海牌海苔2g*32包.jpg', '韩国进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(33, '41.90 泰国进口Durian Monthong榴的华金枕头榴莲干100g', '41.90 泰国进口Durian Monthong榴的华金枕头榴莲干100g.jpg', '泰国进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(34, '99.00 美国进口 万多福（Wonderful）加州开心果 经典盐焗味668g', '99.00 美国进口 万多福（Wonderful）加州开心果 经典盐焗味668g.jpg', '美国进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(35, '119.00 美国进口 绅士牌(Planters)精选大罐混合坚果（腰果、巴旦木、碧根果、巴西果、榛...', '119.00 美国进口 绅士牌(Planters)精选大罐混合坚果（腰果、巴旦木、碧根果、巴西果、榛子）963g.jpg', '美国进口 ', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(36, '155.00 日本进口Calbee卡乐比薯条三兄弟180g*2盒 北海道卡乐B进口休闲零食品', '155.00 日本进口Calbee卡乐比薯条三兄弟180g*2盒 北海道卡乐B进口休闲零食品.jpg', '日本进口', 8, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(37, '78.00 茅台集团 习酒 红习酱1952 53度 单瓶装白酒500ml 口感酱香型', '78.00 茅台集团 习酒 红习酱1952 53度 单瓶装白酒500ml 口感酱香型.jpg', '茅台', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(38, '156.00 洋河蓝色经典 海之蓝 52度 480ml 口感绵柔浓香型', '156.00 洋河蓝色经典 海之蓝 52度 480ml 口感绵柔浓香型.jpg', '海之蓝', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(39, '359.00 茅台集团 习酒 红习酱359.00 1952 53度500ml*6瓶 整箱装白酒 口感...', '359.00 茅台集团 习酒 红习酱359.00 1952 53度500ml*6瓶 整箱装白酒 口感酱香型.jpg', '茅台', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(40, '378.00 剑南春 水晶剑 52度 单瓶装白酒 500ml 口感浓香型', '378.00 剑南春 水晶剑 52度 单瓶装白酒 500ml 口感浓香型.jpg', '剑南春 ', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(41, '468.00 茅台 迎宾 53度 整箱装白酒 500ml*6瓶 口感酱香型', '468.00 茅台 迎宾 53度 整箱装白酒 500ml*6瓶 口感酱香型.jpg', '茅台', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(42, '88.00 法国进口红酒 拉菲（LAFITE）传奇波尔多干红葡萄酒 750ml（ASC', '88.00 法国进口红酒 拉菲（LAFITE）传奇波尔多干红葡萄酒 750ml（ASC）.jpg', '法国进口', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(43, '108.00 法国进口红酒 克鲁斯大帝干红葡萄酒双支礼盒装带酒具 750ml*2瓶', '108.00 法国进口红酒 克鲁斯大帝干红葡萄酒双支礼盒装带酒具 750ml*2瓶.jpg', '法国进口', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0),
(44, '148.00 长城（GreatWall）红酒 特酿3年解百纳干红葡萄酒 整箱装 750ml*6瓶', '148.00 长城（GreatWall）红酒 特酿3年解百纳干红葡萄酒 整箱装 750ml*6瓶.jpg', '长城', 7, '', '', '', 0.00, '0000-00-00', '0000-00-00', 0.00, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`,`unit_price`,`inventory`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
